#include <stdio.h>
int main()
{
    int i,j,m,n;
    int k1[2],k2[2];
    char A[5] = {'\0'},B[5] = {'\0'},C[5]={'+','-','*','/'};
    scanf("%s %s",A,B);
    for(i = 0;i < 4;i++){
        if(A[i] == '/')
            m = i;
        if(B[i] == '/')
            n = i;  
    } 
    k1[0] = (A[m - 1] - '0') / (A[m + 1] - '0');
    k1[1] = (A[m - 1] - '0') % (A[m + 1] - '0');
    k2[0] = (B[m - 1] - '0') / (B[m + 1] - '0');
    k2[1] = (B[m - 1] - '0') % (B[m + 1] - '0');
    if(m == 2 && n == 2){//全正
        for(i=0;i<4;i++)
            printf("%s %c %s = %d %d")
    }
}
